# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSet..::..Contains Method
ViewSet Class See Also
---
Tests for the existence of a view within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	View item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As View _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	View^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ViewThe view to be searched for.
# ### Return Value
The Contains method returns True if the view is within the set, otherwise False.
# See Also
ViewSet Class
Autodesk.Revit.DB Namespace